#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Процедура СоздатьОбработкиПоРепозиторию() Экспорт
	
	НастройкиПользователя = Справочники.НастройкиПользователей.НастройкиТекущегоПользователя();
	ВнешниеФайлы = РаботаСGit.ВнешниеФайлыСРепозитория(НастройкиПользователя.КаталогРепозитория);
	
	Для Каждого Элемент Из ВнешниеФайлы Цикл
		НайденнаяСсылка = НайтиПоНаименованию(Элемент.ИмяОбработки, Истина,,НастройкиПользователя.Проект);
		Если НайденнаяСсылка.Пустая() Тогда
			ОбъектыРазработкиОбъект = СоздатьЭлемент();
			ОбъектыРазработкиОбъект.Владелец = НастройкиПользователя.Проект;
			ОбъектыРазработкиОбъект.УстановитьНовыйКод();
			ОбъектыРазработкиОбъект.Наименование = Элемент.ИмяОбработки;
			ОбъектыРазработкиОбъект.ТипОбъектаРазработки = Элемент.ТипОбъектаРазработки;
			ОбъектыРазработкиОбъект.Версия = Элемент.НомерВерсии;
			ОбъектыРазработкиОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
