#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Функция НастройкиТекущегоПользователя() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПользователей.ТокенGitLab КАК ТокенGitLab,
		|	НастройкиПользователей.ТокенBitrix КАК ТокенBitrix,
		|	НастройкиПользователей.Проект КАК Проект,
		|	НастройкиПользователей.КаталогРепозитория КАК КаталогРепозитория,
		|	НастройкиПользователей.Ссылка КАК Настройка,
		|	НастройкиПользователей.ИмяПользователяGitLab КАК ИмяПользователяGitLab,
		|	НастройкиПользователей.ПочтаПользователяGitLab КАК ПочтаПользователяGitLab,
		|	НастройкиПользователей.КаталогРепозиторияНаШаре КАК КаталогРепозиторияНаШаре,
		|	НастройкиПользователей.УпрощенныйВыводЛогов КАК УпрощенныйВыводЛогов
		|ИЗ
		|	Справочник.НастройкиПользователей КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Владелец = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);	
	Иначе
		Возврат Новый Структура;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли

