#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = Пользователи.АвторизованныйПользователь();
		Объект.ТипSQL = Перечисления.ТипыSQL.MSSQLServer;
		Объект.НомерВерсииПлатформы = "8.3.22.2283";
		Объект.ЛогинSQL = "ibcmd";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьНачалоВыбораRAS(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	ДиалогОткрытия.Каталог = Объект.КаталогRAS;  
	ДиалогОткрытия.Заголовок = "Выберите каталог RAS"; 
	ДиалогОткрытия.Показать(Новый ОписаниеОповещения("ВыборКаталогаRAS_Завершение", ЭтотОбъект, "" ))
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьНачалоВыбораРепозитория(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	ДиалогОткрытия.Каталог = Объект.КаталогРепозитория;  
	ДиалогОткрытия.Заголовок = "Выберите каталог RAS"; 
	ДиалогОткрытия.Показать(Новый ОписаниеОповещения("ВыборКаталогаРепозитория_Завершение", ЭтотОбъект, "" ))
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборКаталогаRAS_Завершение(Результат, Параметр) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.КаталогRAS = Результат[0]
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаРепозитория_Завершение(Результат, Параметр) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.КаталогРепозитория = Результат[0]
КонецПроцедуры


#КонецОбласти